using UnityEngine;

public class Class1 : MonoBehaviour
{

    int playerHp;
    int maxHp;

    long skill;

    int level;
    bool hasKey;

    private void Update()
    {
        // 1. 자료형 ==========================================================================

        //1번 문제
        // 다음 중 int 자료형의 정의 및 특징에 대한 설명으로 올바르지 않은 것은 무엇일까요?
        // 1. 소수점이 없는 정수(Integer) 값을 저장하는 데 사용된다.

        // 2. 변수 선언 =======================================================================

        //1번 문제
        //playerHp 와 maxHp 변수를 정수형의 공개 변수로 선언하세요.

        //2번 문제
        //6,147,483,648의 값을 담을 수 있는 skill 변수를 적절한 정수형의 공개 변수로 선언하고 해당 값을 할당하세요.

        //3번 문제
        //level 변수를 실수형의 비공개 변수로 선언하세요.

        //4번 문제
        //hasKey 변수를 논리형의 비공개 변수로 선언하세요.


        // 3.조건문 ===========================================================================

        //1번 문제
        //level이 10 이상이거나 hasKey가 true라면 "비밀 문이 열렸습니다."를 출력하세요.
        //조건을 만족하지 못하면 "레벨이 부족하거나 열쇠가 없습니다."를 출력하세요.

        //2번 문제
        //skill 값이 0일 때는 "skill 0"이라고 출력하세요.
        //값이 2일 때는 "skill 2"라고 출력하세요.
        //지정되지 않은 나머지 값이 들어올 경우에는 "skill default"라고 출력하세요.

        //3번 문제
        //playerHp가 maxHp와 같다면 콘솔에 "playerHp는 100이다."라고 출력하세요.
        //playerHp가 maxHp보다 작다면 "playerHp는 maxHp보다 작다."라고 출력하세요.
        //그 외의 모든 경우에는 에러 로그를 사용하여 "playerHp 값 오류."라고 출력하세요.

    }

}
